{"title": "\n      Where the Forest Meets the Stars\n", "author": "Glendy Vanderah", "stars": "\n  4.16\n", "ratings": "\n  66,196\n  ratings\n", "reviews": "\n    6,147\n    reviews\n", "summary": "\nA mysterious child teaches two strangers how to love and trust again.After the loss of her mother and her own battle with breast cancer, Joanna Teale returns to her graduate research on nesting birds in rural Illinois, determined to prove that her recent hardships have not broken her. She throws herself into her work from dusk to dawn, until her solitary routine is\nA mysterious child teaches two strangers how to love and trust again.After the loss of her mother and her own battle with breast cancer, Joanna Teale returns to her graduate research on nesting birds in rural Illinois, determined to prove that her recent hardships have not broken her. She throws herself into her work from dusk to dawn, until her solitary routine is disrupted by the appearance of a mysterious child who shows up at her cabin barefoot and covered in bruises.The girl calls herself Ursa, and she claims to have been sent from the stars to witness five miracles. With concerns about the child’s home situation, Jo reluctantly agrees to let her stay—just until she learns more about Ursa’s past.Jo enlists the help of her reclusive neighbor, Gabriel Nash, to solve the mystery of the charming child. But the more time they spend together, the more questions they have. How does a young girl not only read but understand Shakespeare? Why do good things keep happening in her presence? And why aren’t Jo and Gabe checking the missing children’s website anymore?Though the three have formed an incredible bond, they know difficult choices must be made. As the summer nears an end and Ursa gets closer to her fifth miracle, her dangerous past closes in. When it finally catches up to them, all of their painful secrets will be forced into the open, and their fates will be left to the stars.\n...more\n"}